<a href="https://colab.research.google.com/github/Adeajakaye/DS.doyin/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
pd.dataframe()

AttributeError: ignored

In [ ]:
a= pd.DataFrame()

In [ ]:
print(a)

Empty DataFrame
Columns: []
Index: []

In [ ]:
#creating a dataframe in dictionaries

In [ ]:
df_dict={"county": ["Ghana", "Kenya","Nigeria", "Togo"], "capital": ["Accra","Nairobi","Abuja","Lome"],
         "population":[10000, 4000, 50000, 8000], "age":[60,70,80,65]}

In [ ]:
df=pd.DataFrame(df_dict, index=[1,2,3,4])

In [ ]:
df

    county  capital  population  age
1    Ghana    Accra       10000   60
2    Kenya  Nairobi        4000   70
3  Nigeria    Abuja       50000   80
4     Togo     Lome        8000   65

In [ ]:
df_list = [["Ghana","Accra", 10000, 60],
          ["Kenya", "Nairobi", 4000, 70],
          ["Nigeria", "Abuja", 50000, 80],
          ["Togo", "Lome", 8000, 65]]

In [ ]:
df1=pd.DataFrame(df_list, index=[1,2,3,4])

In [ ]:
df1

         0        1      2   3
1    Ghana    Accra  10000  60
2    Kenya  Nairobi   4000  70
3  Nigeria    Abuja  50000  80
4     Togo     Lome   8000  65

In [ ]:
df1=pd.DataFrame(df_list, columns=["country","capital","population","age"], index=[1,2,3,4])

In [ ]:
df1

   country  capital  population  age
1    Ghana    Accra       10000   60
2    Kenya  Nairobi        4000   70
3  Nigeria    Abuja       50000   80
4     Togo     Lome        8000   65

In [ ]:
df

    county  capital  population  age
1    Ghana    Accra       10000   60
2    Kenya  Nairobi        4000   70
3  Nigeria    Abuja       50000   80
4     Togo     Lome        8000   65

In [ ]:
df1

   country  capital  population  age
1    Ghana    Accra       10000   60
2    Kenya  Nairobi        4000   70
3  Nigeria    Abuja       50000   80
4     Togo     Lome        8000   65

In [ ]:
import pandas as pd

In [ ]:
url="https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv"

In [ ]:
data=pd.read_csv(url)

In [ ]:
data.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [ ]:
data.describe()

       utility_id_ferc1  ...  fuel_cost_per_mmbtu
count      29523.000000  ...         29523.000000
mean         118.601836  ...            19.304354
std           74.178353  ...          2091.540939
min            1.000000  ...           -41.501000
25%           55.000000  ...             1.940000
50%          122.000000  ...             4.127000
75%          176.000000  ...             7.745000
max          514.000000  ...        359278.000000

[8 rows x 7 columns]

In [ ]:
data.size

324753

In [ ]:
data.shape

(29523, 11)

In [ ]:
df

NameError: ignored

In [ ]:
df1

NameError: ignored

In [ ]:
data

                     record_id  ...  fuel_cost_per_mmbtu
0        f1_fuel_1994_12_1_0_7  ...                1.121
1       f1_fuel_1994_12_1_0_10  ...                1.120
2        f1_fuel_1994_12_2_0_1  ...                1.650
3        f1_fuel_1994_12_2_0_7  ...                1.970
4       f1_fuel_1994_12_2_0_10  ...                2.570
...                        ...  ...                  ...
29518  f1_fuel_2018_12_12_0_13  ...                9.030
29519   f1_fuel_2018_12_12_1_1  ...                6.950
29520  f1_fuel_2018_12_12_1_10  ...                8.990
29521  f1_fuel_2018_12_12_1_13  ...                1.110
29522  f1_fuel_2018_12_12_1_14  ...               11.680

[29523 rows x 11 columns]

In [ ]:
data.tail

<bound method NDFrame.tail of                      record_id  ...  fuel_cost_per_mmbtu
0        f1_fuel_1994_12_1_0_7  ...                1.121
1       f1_fuel_1994_12_1_0_10  ...                1.120
2        f1_fuel_1994_12_2_0_1  ...                1.650
3        f1_fuel_1994_12_2_0_7  ...                1.970
4       f1_fuel_1994_12_2_0_10  ...                2.570
...                        ...  ...                  ...
29518  f1_fuel_2018_12_12_0_13  ...                9.030
29519   f1_fuel_2018_12_12_1_1  ...                6.950
29520  f1_fuel_2018_12_12_1_10  ...                8.990
29521  f1_fuel_2018_12_12_1_13  ...                1.110
29522  f1_fuel_2018_12_12_1_14  ...               11.680

[29523 rows x 11 columns]>

In [ ]:
data["fuel_qty_burned"]

0         5377489.0
1        10486945.0
2         2978683.0
3         3739484.0
4           40533.0
            ...
29518       18799.0
29519      806730.0
29520      104554.0
29521      315945.0
29522       17853.0
Name: fuel_qty_burned, Length: 29523, dtype: float64

In [ ]:
data["fuel_qty_burned"].head()

0     5377489.0
1    10486945.0
2     2978683.0
3     3739484.0
4       40533.0
Name: fuel_qty_burned, dtype: float64

In [15]:
data.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [17]:
data.to_csv("url")

In [18]:
hamoye_data=data.to_csv("url")

In [19]:
hamoye_data.head()

AttributeError: ignored

In [20]:
data

                     record_id  ...  fuel_cost_per_mmbtu
0        f1_fuel_1994_12_1_0_7  ...                1.121
1       f1_fuel_1994_12_1_0_10  ...                1.120
2        f1_fuel_1994_12_2_0_1  ...                1.650
3        f1_fuel_1994_12_2_0_7  ...                1.970
4       f1_fuel_1994_12_2_0_10  ...                2.570
...                        ...  ...                  ...
29518  f1_fuel_2018_12_12_0_13  ...                9.030
29519   f1_fuel_2018_12_12_1_1  ...                6.950
29520  f1_fuel_2018_12_12_1_10  ...                8.990
29521  f1_fuel_2018_12_12_1_13  ...                1.110
29522  f1_fuel_2018_12_12_1_14  ...               11.680

[29523 rows x 11 columns]

In [21]:
data.describe(include="all")

                      record_id  ...  fuel_cost_per_mmbtu
count                     29523  ...         29523.000000
unique                    29523  ...                  NaN
top     f1_fuel_2005_12_281_2_1  ...                  NaN
freq                          1  ...                  NaN
mean                        NaN  ...            19.304354
std                         NaN  ...          2091.540939
min                         NaN  ...           -41.501000
25%                         NaN  ...             1.940000
50%                         NaN  ...             4.127000
75%                         NaN  ...             7.745000
max                         NaN  ...        359278.000000

[11 rows x 11 columns]

In [22]:
data=pd.read_csv("url", error_bad_lines=False)

In [24]:
data.head()

   Unnamed: 0  ... fuel_cost_per_mmbtu
0           0  ...               1.121
1           1  ...               1.120
2           2  ...               1.650
3           3  ...               1.970
4           4  ...               2.570

[5 rows x 12 columns]

In [25]:
data.describe(include="all")

          Unnamed: 0  ... fuel_cost_per_mmbtu
count   29523.000000  ...        29523.000000
unique           NaN  ...                 NaN
top              NaN  ...                 NaN
freq             NaN  ...                 NaN
mean    14761.000000  ...           19.304354
std      8522.700335  ...         2091.540939
min         0.000000  ...          -41.501000
25%      7380.500000  ...            1.940000
50%     14761.000000  ...            4.127000
75%     22141.500000  ...            7.745000
max     29522.000000  ...       359278.000000

[11 rows x 12 columns]

In [27]:
data.isnull().sum()

Unnamed: 0                        0
record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64